[
  {
    "timestamp": "2025-05-07T10:26:52.762407",
    "ingredients": [
      "sahne",
      "eier",
      "pasta"
    ],
    "recipes": {
      "recipe1": {
        "name": "Cremige Eiernudeln",
        "ingredients": [
          "Pasta",
          "Eier",
          "Sahne",
          "Salz",
          "Pfeffer",
          "Knoblauch",
          "Parmesan"
        ],
        "instructions": [
          "Die Pasta nach Packungsanweisung in einem Topf mit Salzwasser al dente kochen und abgießen.",
          "In einer Schüssel die Eier mit der Sahne, Salz, Pfeffer und gehacktem Knoblauch verquirlen.",
          "Die heiße Pasta zurück in den Topf geben und vom Herd nehmen.",
          "Die Eier-Sahne-Mischung über die heiße Pasta gießen und gut umrühren, sodass die Eier leicht stocken und eine cremige Sauce entsteht.",
          "Den geriebenen Parmesan hinzufügen und erneut umrühren.",
          "Warm servieren und nach Belieben mit frischen Kräutern garnieren."
        ]
      },
      "recipe2": {
        "name": "Pasta Frittata",
        "ingredients": [
          "Pasta",
          "Eier",
          "Sahne",
          "Salz",
          "Pfeffer",
          "Olivenöl",
          "Zwiebel"
        ],
        "instructions": [
          "Die Pasta vom Vortag verwenden oder frisch kochen und abkühlen lassen.",
          "Die Eier in einer Schüssel mit Sahne, Salz und Pfeffer verquirlen.",
          "Eine Pfanne mit Olivenöl erhitzen und die gehackte Zwiebel darin anbraten, bis sie glasig ist.",
          "Die gekochte Pasta in die Pfanne hinzufügen und kurz durchrühren.",
          "Die Eiermischung darüber gießen und bei mittlerer Hitze stocken lassen.",
          "Wenn die Ränder fest werden, die Pfanne in den vorgeheizten Ofen schieben und bei 180 Grad Celsius ca. 10 Minuten backen, bis die Frittata komplett gestockt und leicht gebräunt ist.",
          "Warm oder kalt servieren."
        ]
      },
      "recipe3": {
        "name": "Sahne-Eierauflauf mit Pasta",
        "ingredients": [
          "Pasta",
          "Eier",
          "Sahne",
          "Salz",
          "Pfeffer",
          "Muskatnuss",
          "Butter"
        ],
        "instructions": [
          "Die Pasta al dente kochen und abgießen.",
          "Den Backofen auf 180 Grad Celsius vorheizen.",
          "Eine Auflaufform mit Butter ausstreichen.",
          "In einer Schüssel die Eier mit der Sahne, Salz, Pfeffer und einer Prise Muskatnuss verquirlen.",
          "Die gekochte Pasta in die vorbereitete Auflaufform geben und die Eier-Sahne-Mischung darüber gießen.",
          "Eventuell nochmals mit Salz und Pfeffer abschmecken.",
          "Im Ofen ca. 20-25 Minuten backen, bis die Oberfläche goldbraun ist und der Auflauf durchgestockt ist.",
          "Heiß servieren."
        ]
      }
    }
  }
]